## Data Frame

Enquanto uma série é um objeto unidimensional (vetor), o DataFrame é um objeto bidimensional (matriz). O DataFrame pode ter uma ou mais colunas contendo dados de diferentes tipos.

In [1]:
# Importando o Pandas
import pandas as pd

**Criando um DataFrame**

In [2]:
# Criando um dicionário
# Usamos a tabela de pontuação final do Campenoato Brasileiro de 2004
data = {'Times': ['Santos', 'Atletico Paranaense', 'Sao Paulo', 'Palmeiras', 'Corinthians', 'Goias', 'Juventude'],
        'Pts': [89, 86, 82, 79, 74, 72, 70],
        'V': [27, 25, 24, 22, 20, 21, 20],
        'E': [8, 11, 10, 13, 14, 9, 10],
        'D': [11, 10, 12, 11, 12, 16, 16]}

frame = pd.DataFrame(data) # Atribuindo à um DataFrame do Pandas
frame

                 Times  Pts   V   E   D
0               Santos   89  27   8  11
1  Atletico Paranaense   86  25  11  10
2            Sao Paulo   82  24  10  12
3            Palmeiras   79  22  13  11
4          Corinthians   74  20  14  12
5                Goias   72  21   9  16
6            Juventude   70  20  10  16

In [3]:
# Podemos ter uma ideia do DataFrame olhando os dados iniciais através do comando head
frame.head(3)

                 Times  Pts   V   E   D
0               Santos   89  27   8  11
1  Atletico Paranaense   86  25  11  10
2            Sao Paulo   82  24  10  12

In [4]:
# Podemos verificar o tipo de dados de cada coluna
frame.dtypes

Times    object
Pts       int64
V         int64
E         int64
D         int64
dtype: object

In [5]:
# Ao criarmos um DataFrame, podemos escolher quais colunas e em que ordem:
pd.DataFrame(data, columns=['Pts', 'Times'])

   Pts                Times
0   89               Santos
1   86  Atletico Paranaense
2   82            Sao Paulo
3   79            Palmeiras
4   74          Corinthians
5   72                Goias
6   70            Juventude

In [6]:
# Caso uma coluna não possua dados, o Pandas completará com valores perdidos (NaN)
frame2 = pd.DataFrame(data, columns=['Times', 'Pts', 'V', 'E', 'D', 'SG'],
                      index=[1, 2, 3, 4, 5, 6, 7])

frame2

                 Times  Pts   V   E   D   SG
1               Santos   89  27   8  11  NaN
2  Atletico Paranaense   86  25  11  10  NaN
3            Sao Paulo   82  24  10  12  NaN
4            Palmeiras   79  22  13  11  NaN
5          Corinthians   74  20  14  12  NaN
6                Goias   72  21   9  16  NaN
7            Juventude   70  20  10  16  NaN

In [7]:
# Podemos mostrar uma coluna aravés de seu nome
frame2['Times']

1                 Santos
2    Atletico Paranaense
3              Sao Paulo
4              Palmeiras
5            Corinthians
6                  Goias
7              Juventude
Name: Times, dtype: object

In [8]:
# Ou uma linha através de seu índice
frame2.loc[4]

Times    Palmeiras
Pts             79
V               22
E               13
D               11
SG             NaN
Name: 4, dtype: object

In [9]:
# Colunas podem ser modificadas por atribuição.
frame2['SG'] = '-'
frame2

                 Times  Pts   V   E   D SG
1               Santos   89  27   8  11  -
2  Atletico Paranaense   86  25  11  10  -
3            Sao Paulo   82  24  10  12  -
4            Palmeiras   79  22  13  11  -
5          Corinthians   74  20  14  12  -
6                Goias   72  21   9  16  -
7            Juventude   70  20  10  16  -

**Slicing**

Sintaxe:

    frame[indice_ini:indice_final step]

In [10]:
# Podemos utilizar o slicing, da mesma forma que utilizamos para as Series do Pandas
frame[:: 2] # Pulando de 2 em 2

         Times  Pts   V   E   D
0       Santos   89  27   8  11
2    Sao Paulo   82  24  10  12
4  Corinthians   74  20  14  12
6    Juventude   70  20  10  16

In [11]:
# Fazendo slicing de linhas e colunas
frame.loc[0:3, 'Times']

0                 Santos
1    Atletico Paranaense
2              Sao Paulo
3              Palmeiras
Name: Times, dtype: object

**Outras Operações**

In [12]:
# Verificando um conteúdo de uma coluna
frame['V'] > 20 # Verificando se o time obteve mais de 20 vitórias

0     True
1     True
2     True
3     True
4    False
5     True
6    False
Name: V, dtype: bool

In [13]:
# Descrevendo as algumas estatísticas dos dados
frame.describe()

             Pts          V          E          D
count   7.000000   7.000000   7.000000   7.000000
mean   78.857143  22.714286  10.714286  12.571429
std     7.221001   2.690371   2.138090   2.439750
min    70.000000  20.000000   8.000000  10.000000
25%    73.000000  20.500000   9.500000  11.000000
50%    79.000000  22.000000  10.000000  12.000000
75%    84.000000  24.500000  12.000000  14.000000
max    89.000000  27.000000  14.000000  16.000000